<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Declarations Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are for various messages related to declarations,
    | e.g., declaration search, declaration-related API request messages, etc.,
    |
    */

    'search' => 'Пошук декларації',
    'count_active' => 'Кількість активних декларацій',
    'show' => 'Показувати',
    'requests' => 'Заявки на декларації',
    'continue' => 'Продовжити створення декларації',
    'delete' => 'Видалити заявку на декларацію',
    'number' => 'Номер декларації',
    'application_for_registration_of_declaration' => 'Заявка на реєстрацію декларації',
    'create_an_application' => 'Створити заявку',
    'simplified_declaration_creation' => 'Заявка на переукладання декларації',
    'approve_declaration_request' => 'Підтвердити заявку',
    'sign_declaration_request' => 'Підписати заявку',
    'confirmation_of_application_for_registration_of_declaration' => 'Підтвердження заявки на реєстрацію декларації',
    'simplified_declaration_registration_warning_message-0' => 'Заявка на укладання декларації успішно підтверджена. Оскільки у пацієнта вже є активна декларація з реорганізованим закладом,',
    'simplified_declaration_registration_warning_message-1' => 'ця декларація буде укладена за спрощеною схемою, тобто на підставі інформації з наявної декларації, без участі пацієнта.',
    'simplified_declaration_registration_warning_message-2' => 'Операція має незворотну дію - підписуючи заявку, ви автоматично деактивуєте наявну декларацію з реорганізованого закладу.',
    'patient_confirm_information_message' => "інформація з пам'ятки пацієнта повідомлена пацієнту або його законному представнику",
    'confirmation_of_patient_signature_on_declaration_application' => 'Підтвердження підписання заявки на декларацію пацієнтом',
    'print_declaration_instruction' => 'Роздрукуйте заявку на декларацію в двох екземплярах з метою перевірки та підписання пацієнтом або його законним представником',
    'print_application' => 'Надрукувати заявку',
    'signed_confirmation' => 'Підтвердіть, що заявка на декларацію підписана пацієнтом або його законним представником',
    'patient_signed_declaration' => 'Декларація про вибір лікаря, який надає первинну медичну допомогу підписана пацієнтом',
    'approve' => 'Підтвердити декларацію',
    'reject_declaration_request' => 'Скасувати заявку на декларацію',
    'rejected_declaration_request' => 'Заявка на декларацію скасована',
    'sign' => 'Підписати декларацію',
    'resign' => 'Переукласти декларацію',
    'label' => 'Декларація',
    'id' => 'Ідентифікатор декларації',
    'start_date' => 'Дата подання декларації',
    'end_date' => 'Дата кінцевої дії декларації',
    'change_reason_if_exist' => 'Причина зміни статусу декларації (за наявності)',
    'change_reason_description_if_exist' => 'Опис причини зміни статусу (за наявності)',
    'print_declaration' => 'Надрукувати декларацію',
    'show_declaration' => 'Показати декларацію',
    'medical_worker_confirmation' => "Ви, як медичний працівник закладу охорони здоров'я:",
    'patient_identified' => 'підтверджуєте, що пацієнта як особу ідентифіковано:',
    'informed_about_data_processing' => 'підтверджуєте, що повідомили пацієнту або його законному представнику мету та підстави обробки його персональних даних.',
    'patient_memo' => 'ПАМ\'ЯТКА ПАЦІЄНТУ',
    'sms_or_documents_note' => 'Надаючи код з СМС повідомлення або документи (при попередній реєстрації пацієнта в системі за документами) особа чи її представник:',
    'consent_data_processing' => 'надає згоду медичному працівнику на обробку персональних даних пацієнта:',
    'consent_declaration_submission' => 'надає згоду медичному працівнику на подання декларації про вибір лікаря, який надає первинну медичну допомогу в електронну систему охорони здоров\'я.',
    'for_reorganized' => 'Декларації реорганізованих закладів',
    'reorganized_uuid' => 'Ідентифікатор реорганізованого закладу',
    'reorganized_name' => 'Назва реорганізованого закладу',

    'sync' => [
        'started' => 'Синхронізація декларацій запущена у фоновому режимі',
        'completed' => 'Синхронізація декларацій успішно завершена',
        'failed' => 'Синхронізація декларацій не вдалася',
    ],

    'policy' => [
        'create' => 'У вас немає дозволу на створення заявки на подання декларації',
        'approve' => 'У вас немає дозволу на підтвердження заявки на подання декларації.',
        'sign' => 'У вас немає дозволу на підписання заявки на подання декларації.',
        'resign' => 'У вас немає дозволу на переукладання декларації.',
        'reject' => 'У вас немає дозволу на відхилення заявки на подання декларації',
        'delete' => 'У вас немає дозволу на видалення заявки на подання декларації',
        'sync' => 'У вас немає дозволу на синхронізацію декларацій'
    ],

    'status' => [
        'label' => 'Статус декларації',
        'active' => 'Діючий',
        'closed' => 'Закритий',
        'pending_verification' => 'В очікуванні верифікації',
        'rejected' => 'Відхилений',
        'terminated' => 'Припинений',
        // Statuses for reorganized declarations
        'to_be_resigned' => 'Потребує переукладання',
        'resigned' => 'Переукладена'
    ],
];
