<?php

declare(strict_types=1);

return [
    'policy' => [
        'deny' => [
            'deactivate' => 'У вас немає дозволу на деактивацію цього місця надання послуг',
            'activate' => 'У вас немає дозволу на активацію цього місця надання послуг',
            'create' => 'У вас немає дозволу на створення місця надання послуг',
            'edit' => 'У вас немає дозволу на редагування цього місця надання послуг',
            'delete' => 'У вас немає дозволу на видалення чернетки цього місця надання послуг'
        ]
    ],

    // modal
    'modals' => [
        'activate' => [
            'title' => 'Підтвердження активації МНП',
            'confirmation_text' => 'Ви впевнені, що хочете активувати це МНП?',
        ],
        'deactivate' => [
            'title' => 'Підтвердження деактивації МНП',
            'confirmation_text' => 'Ви впевнені, що хочете деактивувати це МНП?',
        ],
        'delete' => [
            'title' => 'Підтвердження видалення чернетки',
            'confirmation_text' => 'Ви впевнені, що хочете видалити цю чернетку?',
        ],
    ],

    'request' => [
        'activated' => 'Місце надання послуг активовано',
        'deactivated' => 'Місце надання послуг деактивовано',
        'sync' => [
            'started_in_bg' => 'Синхронізація запущена у фоновому режимі',
            'errors' => [
                'fail' => 'Помилка синхронізації. Зверніться до адміністратора.'
            ]
        ]
    ],

    // draft
    'draft' => [
        'delete_success' => 'Чернетку успішно видалено.',
        'errors' => [
            'delete' => 'Цю чернетку місця надання послуг не вдалось видалити',
        ]
    ],

    'errors' => [
        'commonError' => 'Місце надання послуг: загальна помилка',
        'deactivate' => 'Це місце надання послуг не вдалось деактивувати',
        'activate' => 'Це місце надання послуг не вдалось активувати',
        'status' => 'Місце надання послуг має неактивний статус. Створення послуги неможливо.',
        'external_id' => "Поле 'Зовнішній ідeнтифікатор' має містити ціле число",
        'location' => [
            'required_type' => 'Для даного типу медичного закладу заповнення полів Location - обов\'язкове',
            'longitude_required' => 'Якщо введено широту, довгота також обов\'язкова',
            'latitude_required' => 'Якщо введено довготу, широта також обов\'язкова',
            'loсation_misformat' => 'Ціла частина має бути від 1 до 90. Дробова - до 6 знаків',
        ],
        'type' => 'Не вірний тип місця надання послуг',
        'mapping' => 'Вказаний тип місця надання послуг не дозволяється для поточного закладу',
        'workingHours' => [
            'commonError' => 'Помилка для вказаних часових проміжків',
            'wrongRange' => 'Час закінчення менше часу початку',
            'wrongFormat' => 'Невірний формат часу (має бути ГГ:ХХ)',
            'wrongShiftStart' => 'Початок поточної зміни не може бути раніше кінця попередньої'
        ],
        'address' => [
            'commonError' => 'Помилка заповнення даних адреси',
            'type' => 'Неіснуючий тип адреси для місця надання послуг',
            'settlementType' => 'Неіснуючий тип населеного пункту для місця надання послуг',
            'streetType' => 'Неіснуючий тип вулично-дорожної системи для місця надання послуг',
            'zip' => 'Неправильний формат індексу',
            'mapping' => 'Вказаний тип адреси не дозволяється для даного типу місця надання послуг і поточного закладу',
        ],
        'email' => [
            'required' => 'Поле E-mail є обов’язковим',
            'wrong' => 'Введіть дійсну адресу електронної пошти'
        ],
        'phone' => [
            'commonError' => 'Помилка заповнення телефонного номеру',
            'type_required' => "Поле 'Тип номера' є обов’язковим",
            'type' => 'Невірний тип телефонного зв\'язку',
            'number_required' => "Поле 'Номер телефону' є обов’язковим",
            'number' => 'Невірно вказаний телефонний номер'
        ]
    ],

    'division_updated' => 'Дані місця надання послуг було оновлено',
    'receptionShow' => 'Додаткова адреса (рецепція)',
];
