<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Healthcare Services Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are for various messages related to healthcare services,
    | e.g., healthcare services search, healthcare services-related API request messages, etc.,
    |
    */

    'add' => 'Нова послуга',
    'for_division' => 'Для «:name»',
    'available_time' => 'Графік доступності',
    'providing_condition' => 'Умови надання послуги',
    'category' => 'Категорія послуги',
    'speciality_type' => 'Лікарська спеціальність',
    'type' => 'Тип медичної послуги',
    'license' => 'Ліцензія закладу',
    'all_day' => 'Цілодобово',
    'available_time_info' => "Всі дні з незаповненими даними автоматично отримують статус 'Не доступна'",
    'specialisation' => 'Спеціалізація',
    'status' => 'Статус послуги',
    'continue' => 'Продовжити створення послуги',
    'delete' => 'Видалити чернетку послуги',
    'add_non_working_hours' => 'Додати неробочий час',
    'start_non_working_time' => 'Початок неробочого часу',
    'end_non_working_time' => 'Кінець неробочого часу',
    'choose_time' => 'Оберіть час',
    'comment_non_working_hours' => 'Коментар до неробочого часу',
    'non_working_hours' => 'Неробочий час №',
    'service_search' => 'Пошук',

     // modals
    'modals' => [
        'activate' => [
            'title' => 'Підтвердження активації медичної послуги',
            'confirmation_text' => 'Ви впевнені, що хочете активувати цю послугу?',
        ],
        'deactivate' => [
            'title' => 'Підтвердження деактивації медичної послуги',
            'confirmation_text' => 'Ви впевнені, що хочете деактивувати цю послугу?',
        ],
        'delete' => [
            'title' => 'Підтвердження видалення чернетки',
            'confirmation_text' => 'Ви впевнені, що хочете видалити цю чернетку?',
        ],
    ],

    'success' => [
        'created' => 'Послугу успішно створено.',
        'draft_created' => 'Чернетку послуги успішно створено.',
        'updated' => 'Послугу успішно оновлено.',
        'activated' => 'Послугу успішно активовано',
        'deactivated' => 'Послугу успішно деактивовано',
        'draft_deleted' => 'Чернетку послуги успішно видалено',
        'sync_started' => 'Синхронізацію успішно розпочато.',
        'sync_updated' => 'Інформацію успішно оновлено'
    ],

    'policy' => [
        'create' => 'У вас немає дозволу на створення послуги',
        'edit' => 'У вас немає дозволу на редагування цієї послуги',
        'update' => 'У вас немає дозволу на оновлення послуги',
        'activate' => 'У вас немає дозволу на активування послуги',
        'deactivate' => 'У вас немає дозволу на деактивування послуги',
        'delete' => 'У вас немає дозволу на видалення заявки на створення послуги',
        'sync' => 'У вас немає дозволу на синхронізацію послуг'
    ],

    'error' => [
        'sync_failed' => 'Виникла помилка. Оновіть список місць надання послуг та спробуйте ще раз'
    ],

    'validation' => [
        'speciality_type' => [
            'required_if' => 'Поле лікарська спеціальність є обов\'язковим для заповнення, коли категорія послуги є ліцензія на провадження господарської діяльності з медичної практики.',
            'prohibited_unless' => 'Поле лікарська спеціальність заборонено, якщо категорія послуги не є ліцензія на провадження господарської діяльності з медичної практики.',
        ],
        'providing_condition' => [
            'required_if' => 'Поле умови надання послуги є обов\'язковим для заповнення, коли категорія послуги є ліцензія на провадження господарської діяльності з медичної практики.',
            'prohibited_unless' => 'Поле умови надання послуги заборонено, якщо категорія послуги не є ліцензія на провадження господарської діяльності з медичної практики.',
        ],
        'type_coding' => [
            'required_if' => 'Поле тип медичної послуги є обов\'язковим для заповнення, коли категорія послуги є ліцензія на право провадження господарської діяльності з розроблення, виробництва, виготовлення, зберігання, перевезення, придбання, реалізації (відпуску) наркотичних засобів, психотропних речовин і прекурсорів.',
            'prohibited_unless' => 'Поле тип медичної послуги заборонено, якщо категорія послуги не є ліцензія на право провадження господарської діяльності з розроблення, виробництва, виготовлення, зберігання, перевезення, придбання, реалізації (відпуску) наркотичних засобів, психотропних речовин і прекурсорів.',
        ],
        'license_id' => [
            'required_if' => 'Поле ліцензія закладу є обов\'язковим для заповнення, коли категорія послуги пов\'язана з аптечною діяльністю.',
            'prohibited_if' => 'Поле ліцензія закладу заборонено, коли категорія послуги є ліцензія на провадження господарської діяльності з медичної практики.',
        ],
        'not_available' => [
            'end_after_start' => 'Кінець неробочого часу має бути пізніше за початок.',
        ],
    ],
];
