<?php

declare(strict_types=1);

return [
    'policy' => [
        'deny' => [
            'create' => 'У вас немає дозволу на створення закладу',
            'edit' => 'У вас немає дозволу на редагування цього закладу',
            'sync' => 'У вас немає дозволу на синхронізацію даних цього закладу'
        ]
    ],

    'types' => [
        'emergency' => 'Заклад з надання екстренної медичної допомоги',
        'mis' => 'Медична інформаційна система',
        'msp' => 'Заклад з надання медичних послуг',
        'msp_limited' => 'Заклад в процесі реорганізації',
        'msp_pharmacy' => 'Заклад з надання медичних послуг та аптека',
        'nhs' => 'Національна служба здоров\'я України',
        'outpatient' => 'Вторинна, третинна, паліативна медична допомога та реабілітація',
        'pharmacy' => 'Аптека',
        'primary_care' => 'Заклад з надання первинної медичної допомоги'
    ],

    'request' => [
        'sync' => [
            'errors' => [
                'fail' => 'Помилка синхронізації. Зверніться до адміністратора.'
            ]
        ]
    ],

    'status' => [
        'active' => 'Активний',
        'inactive' => 'Неактивний',
        'suspended' => 'Призупинено',
        'edr' => [
            'cancelled' => 'Cкасовано',
            'registered' => 'Зареєстровано',
            'in_progress' => 'В стані припинення',
            'terminated' => 'Припинено',
            'bankruptcy' => 'Порушено справу про банкрутство',
            'bankruptcy_rehabilitation' => 'Порушено справу про банкрутство (санація)',
            'invalid_registration' => 'Зареєстровано, свідоцтво про державну реєстрацію недійсне'
        ]
    ],

    'errors' => [
        'create_fail' => 'Помилка створення закладу. Зверніться до адміністратора.',
        'update_fail' => 'Помилка оновлення закладу. Зверніться до адміністратора.'
    ]
];
