<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Licenses Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are for various messages related to licenses,
    | e.g., license search, license-related API request messages, etc.,
    |
    */

    'add' => 'Додати ліцензію',
    'create' => 'Нова ліцензія',
    'details' => 'Деталі ліцензії',
    'edit' => 'Редагувати ліцензію',
    'kind' => 'Вид ліцензії',
    'order_no' => 'Номер наказу',
    'activity' => 'Напрям діяльності',
    'number' => 'Серія та/або номер ліцензії',
    'what_licensed' => 'Напрям діяльності, що ліцензовано',
    'active_from_date_label' => 'Дата початку дії',
    'active_from_date' => 'Дата початку дії ліцензії',
    'primary' => 'Основна',
    'not_primary' => 'Додаткова',
    'issued_by' => 'Ким видано',
    'issued_date' => 'Дата видачі ліцензії',
    'expiry_date_label' => 'Дата завершення дії',
    'expiry_date' => 'Дата завершення дії ліцензії',

    'type' => [
        'label' => 'Тип ліцензії',
        'placeholder' => 'Оберіть тип ліцензії',
        'msp' => 'ліцензія на провадження господарської діяльності з медичної практики',
        'pharmacy' => 'ліцензія на провадження господарської діяльності з виробництва лікарських засобів, оптової та роздрібної торгівлі лікарськими засобами, імпорту лікарських засобів (крім активних фармацевтичних інгредієнтів)',
        'pharmacy_drugs' => 'ліцензія на право провадження господарської діяльності з розроблення, виробництва, виготовлення, зберігання, перевезення, придбання, реалізації (відпуску) наркотичних засобів, психотропних речовин і прекурсорів'
    ],

    'success' => [
        'created' => 'Ліцензія успішно створена',
        'updated' => 'Ліцензія успішно оновлена',
        'sync' => 'Ліцензії успішно синхронізовані з ЕСОЗ'
    ],

    'policy' => [
        'create' => 'У вас немає дозволу на створення ліцензії',
        'update' => 'У вас немає дозволу на оновлення ліцензії',
        'primary_not_editable' => 'Основну ліцензію не можна редагувати'
    ]
];
