<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Patient Verifications Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are for messages related to patient
    | verification in eHealth, e.g., the verification tab, verification
    | sources and recommendations, death registration, etc.
    |
    */

    'label' => 'Верифікація',
    'plural' => 'Верифікації пацієнтів',
    'ukrainian' => 'Українська',
    'dracs_death_status' => 'Статус верифікації смерті (ДРАЦС)',

    // Warning banner
    'warning_title' => 'Увага!',
    'warning_message' => 'Запит створений, але пацієнт потребує додаткової верифікації з боку НСЗУ. Перевірте будь-ласка статус верифікації пацієнта згодом',
    'warning_banner_title' => 'Увага! Персональні дані пацієнта потребують перевірки:',
    'warning_banner_text' => 'Можливість роботи з ЕСОЗ зокрема деклараціями та медичними записами пацієнта може бути заблоковано. Отримайте від пацієнта (його законного представника) актуальні персональні дані та оновіть запис про нього в ЕСОЗ',
    'warning_banner_notice' => '!!! Укладення нової чи переукладання існуючої декларації про вибір лікаря ПМД - НЕ потрібне.',

    // Table headers
    'direction' => 'Напрям верифікації',
    'status_header' => 'Статус',
    'reason_header' => 'Причина статусу',
    'comment_header' => 'Коментар',
    'recommendations_header' => 'Рекомендації',
    'empty_description' => 'Дані про верифікацію відсутні. Натисніть «Синхронізувати дані з ЕСОЗ», щоб отримати результати перевірки персональних даних пацієнта.',

    // Update in eHealth
    'update_data' => 'Оновити дані',
    'update_data_in_ehealth' => 'Оновити дані в ЕСОЗ',
    'update_dracs_title' => 'Оновити статус верифікації пацієнта в ДРАЦС',
    'reason_field' => 'Причина верифікації',
    'death_date' => 'Дата смерті',
    'comment_death_confirmed' => 'Смерть пацієнта підтверджено',

    'statuses' => [
        'changes_needed' => 'Неуспішно верифіковано (потребує змін)',
        'in_review' => 'На опрацюванні',
        'not_verified' => 'Не верифіковано',
        'verification_needed' => 'Потребує верифікації',
        'verification_not_needed' => 'Не потребує верифікації',
        'verified' => 'Верифіковано'
    ],

    'sources' => [
        'drfo' => 'РНОКПП пацієнта в ДРФО',
        'dracs_death' => 'Актовий запис про смерть пацієнта в ДРАЦСГ',
        'dracs_birth' => 'Свідоцтво про народження пацієнта в ДРАЦСГ',
        'dms_passport' => 'Паспорт пацієнта в ДМС',
        'unzr' => 'УНЗР пацієнта в ЄДДР',
        'nhs' => 'Ручна верифікація працівниками НСЗУ',
        'mvs_passport' => 'Паспорт пацієнта в МВС',
        'dracs_name_change' => 'Актовий запис про зміну імені пацієнта в ДРАЦСГ',
        'legal_capacity' => 'Дієздатність пацієнта'
    ],

    'recommendations' => [
        'drfo' => 'РНОКПП, дата народження або ПІБ не відповідають даним в державному реєстрі ДПС. Необхідно звірити дані про пацієнта отримані з Реєстру пацієнтів (ПІБ, дату народження, РНОКПП). У разі співпадіння даних Реєстру пацієнтів з даними з документів - є розбіжності в реєстрі ДРФО, тому треба спрямувати пацієнта до ДПС. У разі неспівпадіння даних про пацієнта в Реєстрі пацієнтів та документах - внести зміни в запис про пацієнта та пересвідчитись, що дані в Реєстрі пацієнтів оновлені. В разі відмови пацієнта від отримання РНОКПП (наявна відмітка або довідка) необхідно також оновити відомості про документ.',
        'dracs_death' => 'Зафіксовано актовий запис про смерть в державному реєстрі Міністерства юстиції який потребує підтвердження чи спростування від лікаря якому подано декларацію.',
        'dracs_birth' => 'ПІБ, дата народження пацієнта, серія та номер свідоцтва про народження не відповідають даним в державному реєстрі ДРАЦСГ. Необхідно перевірити актуальність даних пацієнта. У разі неспівпадіння даних про пацієнта в Реєстрі пацієнтів та документах - внести зміни в запис про пацієнта та пересвідчитись, що дані в Реєстрі пацієнтів оновлені. У разі співпадіння даних Реєстру пацієнтів з даними з документів - є розбіжності в реєстрі ДРАЦСГ, тому потрібно спрямувати батьків (законного представника) пацієнта до ДРАЦСГ.',
        'dms_passport' => 'Зазначений паспорт пацієнта не дійсний за даними ДМС. Перевірте внесені дані з оригіналом документу. У разі неспівпадіння даних про пацієнта в Реєстрі пацієнтів та документах - оновіть запис про пацієнта. Якщо помилки відсутні - попросіть пацієнта надати дійсний документ або порадьте пацієнту звернутись до ДМС.',
        'unzr' => 'УНЗР пацієнта не відповідає даним в ЄДДР. Внесіть відомості про УНЗР до запису пацієнта з свідоцтва про народження, паспорта або закордонного паспорта. Якщо помилки відсутні - порадьте пацієнту звернутись до ДМС. Якщо у пацієнта немає УНЗР і він був внесений до ЕСОЗ помилково оновіть запис про пацієнта залишивши УНЗР порожнім.',
        'nhs' => 'Пацієнта не верифіковано працівником НСЗУ по причині - :comment.',
        'mvs_passport' => 'Зазначений паспорт пацієнта не дійсний за даними МВС. Перевірте внесені дані з оригіналом документу. У разі неспівпадіння даних про пацієнта в Реєстрі пацієнтів та документах - оновіть запис про пацієнта. Якщо помилки відсутні - порадьте пацієнту звернутись до МВС.',
        'dracs_name_change' => 'Потребує додаткової перевірки за даними ДРАЦСГ щодо зміни імені.',
        'legal_capacity' => 'Потребує додаткової перевірки дієздатності пацієнта.'
    ],

    'errors' => [
        'employee_not_found' => 'Працівника не знайдено.'
    ],

    'policy' => [
        'details' => 'У вас немає дозволу на перегляд статусу верифікації пацієнта.',
        'update' => 'У вас немає дозволу на підтвердження або спростування факту смерті пацієнта.'
    ],

    'messages' => [
        'status_updated' => 'Статус верифікації пацієнта успішно оновлено.'
    ]
];
