<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Preperson (Unidentified Patient) Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for unidentified patients (prepersons).
    |
    */

    'label' => 'Неідентифіковані пацієнти',
    'label_single' => 'Неідентифікований пацієнт',
    'recent' => 'Нещодавні неідентифіковані пацієнти',

    'warning_title' => 'Попередження',
    'warning_text' => "Неідентифікований пацієнт може бути створений лише за необхідністю внесення медичних записів в процесі надання послуг пацієнту в стаціонарних умовах якщо:\n- пацієнт залишається на момент реєстрації в непритомному стані або в стані амнезії та отримує меддопомогу в стаціонарних умовах;\n- пацієнт є новонародженою дитиною без свідоцтва про народження;\n- пацієнт на момент реєстрації не має документів, що посвідчують особу, внаслідок їх втрати;\n- зафіксована смерть неідентифікованого пацієнта.",
    'reason' => 'Причина створення неідентифікованого пацієнта',
    'reasons' => [
        'EMERGENCY_HOSPITALIZATION' => 'Госпіталізація пацієнта бригадою екстреної медичної допомоги',
        'POLICE_HOSPITALIZATION' => 'Госпіталізація пацієнта з обставинами які потребують виклику поліції',
        'NEWBORN_WITHOUT_CERTIFICATE' => 'Пацієнт є новонародженою дитиною без свідоцтва про народження',
        'OTHER_HOSPITALIZATION' => 'Інші обставини звернення для госпіталізації'
    ],
    'ambulance_card_number' => '№ картки виїзду швидкої медичної допомоги',
    'police_report_id' => 'Ідентифікатор заяви в поліцію',
    'police_report_date' => 'Дата подання заяви в поліцію',
    'child_birth_time' => 'Час народження дитини',
    'other_reason' => 'Причини та обставини звернення пацієнта',
    'notes' => [
        'ambulance' => '№ картки виїзду швидкої медичної допомоги: :number',
        'police' => 'Ідентифікатор заяви в поліцію: :id; дата подання заяви в поліцію: :date',
        'newborn' => 'Час народження дитини: :time'
    ],
    'modal_title' => 'Необхідно створити подію та запис в ЕСОЗ',
    'modal_text' => 'Для неідентифікованого пацієнта повинен бути переданий мінімальний набір медичних даних, а саме спостереження стосовно стану, особливих прикмет неідентифікованого пацієнта (наявність татуювання, відсутність зубів, приблизний вік та інші прикмети).',
    'modal_warning_text' => 'Перші медичні дані неідентифікованого пацієнта повинні бути поданими протягом часу (24 години), відведеного з моменту створення такого пацієнта. У разі їх відсутності неідентифікований пацієнт автоматично деактивується в ЕСОЗ.',
    'modal_btn_later' => 'Продовжити пізніше',
    'modal_btn_create' => 'Створити подію та запис',
    'emergency_contact_mother_or_father' => 'Контактна особа (мати чи батько)',
    'register_death' => 'Зареєструвати смерть',
    'get_certificate' => 'Сформувати довідку',
    'note' => 'Примітка',
    'identification' => 'Ідентифікація пацієнта',
    'associate_patient' => 'Приєднати записи неідентифікованого пацієнта до записів ідентифікованого пацієнта',
    'external_id' => "ID пацієнта в закладі охорони здоров'я",
    'contact_person' => 'Контактна особа',
    'info_certificate' => 'Інформаційна довідка',
    'emergency_contact_phones' => "Контактні телефони для екстреного зв'язку",
    'contact_first_name' => "Ім'я контактної особи",
    'contact_last_name' => 'Прізвище контактної особи',
    'contact_second_name' => 'По-батькові контактної особи',
    'print' => 'Надрукувати',
    'delete_draft' => 'Видалити чернетку',
    'confirm_delete_draft' => 'Ви впевнені, що хочете видалити цю чернетку? Цю дію не можна скасувати.',

    'messages' => [
        'draft_created' => 'Чернетку неідентифікованого пацієнта успішно створено.',
        'draft_updated' => 'Чернетку неідентифікованого пацієнта успішно оновлено.',
        'draft_deleted' => 'Чернетку неідентифікованого пацієнта успішно видалено.',
        'created' => 'Неідентифікований пацієнт успішно створений',
        'updated' => 'Дані неідентифікованого пацієнта успішно оновлено.'
    ],

    'policy' => [
        'edit' => 'У вас немає дозволу на продовження реєстрації неідентифікованого пацієнта.',
        'update' => 'У вас немає дозволу на оновлення даних неідентифікованого пацієнта.',
        'delete' => 'У вас немає дозволу на видалення чернетки неідентифікованого пацієнта.',
    ],

    'merge' => [
        'title' => 'Приєднання записів пацієнта ID :uuid до записів ідентифікованого пацієнта',
        'search_patient' => 'Пошук пацієнта',
        'reset_filters' => 'Скинути фільтри',
        'search_results' => 'Результати пошуку',
        'merge_patients' => 'Об\'єднати пацієнтів',
        'no_patients_found' => 'Немає пацієнтів за вказаними критеріями',
        'gender_male' => 'Чоловік',
        'gender_female' => 'Жінка',
        'tax_id_label' => 'РНОКПП(ІПН)',
        'birth_certificate_label' => 'СВІДОЦТВО ПРО НР',
        'auth_methods' => 'Методи автентифікації',
        'auth_via_sms' => 'Автентифікація через СМС',
        'auth_method_name' => 'Назва методу автентифікації',
        'auth_via_documents' => 'Автентифікація через документи',
        'merge_records' => 'Об\'єднання записів',
        'confirm_title' => 'Підтвердження заявки на приєднання записів пацієнта ID :uuid до записів ідентифікованого пацієнта',
        'doctor_obligations' => 'Ви, як медичний працівник закладу охорони здоров\'я:',
        'confirm_identified' => 'підтверджуєте, що пацієнта, як особу ідентифіковано;',
        'confirm_selected_correctly' => 'підтверджуєте, що пацієнта, до якого буде приєднано медичні дані неідентифікованої особи обрано коректно;',
        'confirm_representative' => 'у разі недієздатної особи підтверджуєте перевірку повноважень законного представника пацієнта;',
        'patient_memo' => 'ПАМ\'ЯТКА ПАЦІЄНТУ',
        'providing_code_or_docs' => 'Надаючи код або документи особа чи її законний представник:',
        'memo_point_1' => 'підтверджує, що інформована/ий медичним працівником закладу охорони здоров\'я про мету та підстави обробки персональних даних пацієнта, для якого створюється запис в реєстрі пацієнтів Електронної системи охорони здоров\'я;',
        'memo_point_2' => 'надає згоду медичному працівнику закладу охорони здоров\'я на приєднання медичних даних неідентифікованої особи до медичних даних пацієнта.',
        'memo_warning' => 'УВАГА! Звертаємо увагу пацієнта (законного представника пацієнта) на те, що об\'єднання даних неідентифікованого пацієнта та ідентифікованого пацієнта в ЕСОЗ є безповоротнім процесом.',
        'print_memo' => 'Надрукувати пам\'ятку',
        'memo_communicated' => 'Інформація з пам\'ятки повідомлена пацієнту',
        'phone_access_check' => 'Перевірте, будь ласка, з пацієнтом (його законним представником) наявність доступу до даного номеру:',
        'sms_code' => 'Код з СМС',
        'sms_confirmation_code_label' => 'КОД ПІДТВЕРДЖЕННЯ З СМС',
        'resend_timer' => 'Відправити ще раз (через :seconds с)',
        'file_uploaded_success' => 'Файл :name успішно завантажено!',
        'consent_form_title' => 'Підтвердження підписання форми згоди на об\'єднання ідентифікованого пацієнта та неідентифікованого',
        'consent_step_1' => '1) Роздрукуйте форму згоди для пацієнта або його законного представника',
        'print_consent_form' => 'Надрукувати форму',
        'consent_step_2' => '2) Підтвердіть, що форма згоди підписана пацієнтом або його законним представником',
        'consent_form_signed_checkbox' => 'Інформаційна пам\'ятка про приєднання даних підписана',
        'attention' => 'Увага',
        'attention_warning_text' => 'Створена заявка на об\'єднання медичних записів неідентифікованого пацієнта до записів ідентифікованого повинна бути підтверджена пацієнтом та підписана медичним працівником протягом 1 години після її створення. В протилежному випадку необхідно створити нову заявку на об\'єднання медичних записів.',
        'consent_declaration_header' => 'Форма згоди на об\'єднання ідентифікованого пацієнта та неідентифікованого',
        'consent_i' => 'Я,',
        'consent_to_facility' => ', надаю згоду лікарю що працює у закладі',
        'consent_suffix' => ', на приєднання до моїх медичних даних наступних даних:',
        'episode_name' => 'НАЗВА ЕПІЗОДУ',
        'responsible_organization' => 'ВІДПОВІДАЛЬНА ОРГАНІЗАЦІЯ',
        'period' => 'ПЕРІОД',
        'since_date' => 'з 25.05.2020',
        'unidentified_entered_in_ehealth' => 'які були внесені в ЕСОЗ для неідентифікованої особи:',
        'patient_local_id' => 'ІДЕНТИФІКАТОР ПАЦІЄНТА В ЗАКЛАДІ ОХОРОНИ ЗДОРОВ\'Я:',
        'patient_first_name' => 'ІМ\'Я ПАЦІЄНТА:',
        'patient_last_name' => 'ПРІЗВИЩЕ ПАЦІЄНТА:',
        'patient_second_name' => 'ПО-БАТЬКОВІ ПАЦІЄНТА:',
        'gender' => 'СТАТЬ:',
        'gender_male_value' => 'Чоловіча',
        'additional_info' => 'ДОДАТКОВА ІНФОРМАЦІЯ:',
        'newborn_info_text' => 'Пацієнт є новонародженою дитиною без свідоцтва про народження. Час народження: 03:30',
        'consent_processing_text' => 'Я погоджуюсь на використання та обробку моїх персональних даних за умови забезпечення їх захисту відповідно до вимог Закону України "Про захист персональних даних".',
        'patient_signature' => 'Підпис пацієнта',
        'print' => 'Надрукувати',
        'electronic_signature' => 'Електронний підпис',
        'select_knedp' => '— Обрати —',
        'container_path' => 'Шлях до контейнера *',
        'drag_key_file' => 'Перетягніть сюди файл ключа',
        'or_upload_from_device' => 'або завантажте його зі свого носія',
        'key_file_extension_hint' => '(зазвичай його назва "Key-6.dat" або *.pfx, *.pk8, *.zs2, *.jks)',
        'merge_success_message' => 'Записи неідентифікованого пацієнта успішно об\'єднано з записами ідентифікованого пацієнта (Автентифікація :method)',
    ],
];
