<?php

declare(strict_types=1);

return [
    'title' => 'Мої направлення',
    'search' => 'Пошук направлення',
    'requisition' => '№ направлення',
    'show' => 'Показувати',
    'placeholder_status' => 'Активні, Відмінені',
    'btn_reset' => 'Скинути фільтри',
    
    'table' => [
        'created_at' => 'ДАТА ТА ЧАС СТВОРЕННЯ',
        'service' => 'КОД ТА НАЗВА ПОСЛУГИ',
        'patient_name_age' => 'ПІБ ПАЦІЄНТА<br>ПОВНИХ РОКІВ',
        'priority' => 'ПРІОРИТЕТ',
        'program' => 'ПРОГРАМА',
        'state' => 'СТАН',
        'number' => '№',
    ],

    'priorities' => [
        'stat' => 'Ургентний',
        'routine' => 'Плановий',
    ],

    'statuses' => [
        'active' => 'Активні',
        'completed' => 'Виконані',
        'entered_in_error' => 'Позначені помилковими',
        'revoked' => 'Відкликані',
        'in_progress' => 'В роботі',
    ],

    'status_labels' => [
        'active' => 'Активне',
        'completed' => 'Виконане',
        'entered_in_error' => 'Позначене помилковим',
        'revoked' => 'Відкликане',
        'new' => 'Нове',
        'in_progress' => 'В роботі',
        'in_queue' => 'В черзі',
    ],

    'actions' => [
        'create_en' => 'Створити ЕН',
        'delete_request' => 'Видалити заявку',
        'take_in_work' => 'Взяти в роботу',
        'print_memo' => 'Надрукувати пам\'ятку',
        'cancel_referral' => 'Відмінити направлення',
        'mark_as_error' => 'Позначити помилковим',
    ],

    'modals' => [
        'cancel' => [
            'title' => 'Підтвердження щодо відміни електронного направлення',
            'warning' => 'Дія є незворотною. Ви впевнені, що бажаєте позначити направлення як відмінене?',
            'reason_label' => 'Обґрунтування підстав відміни електронного направлення',
            'btn_confirm' => 'Відмінити електронне направлення',
        ],
        'error' => [
            'title' => 'Підтвердження щодо визначення помилково внесеної медичної документації<br>про пацієнта в ЕСОЗ',
            'warning' => 'Дія є незворотною. Ви впевнені, що бажаєте позначити направлення як внесене<br>помилково? Медична документація, яка визначена такою, що внесена помилково,<br>зберігається в електронній системі охорони здоров\'я!',
            'reason_dropdown_label' => 'Підстава помилкового внесення медичної документації',
            'dropdown_placeholder' => 'Підстава',
            'entered_in_error' => 'Помилкове внесення',
            'other' => 'Інше',
            'reason_label' => 'Обґрунтування підстав визначення помилково внесеної медичної документації',
            'btn_confirm' => 'Позначити документ помилково внесеним',
        ]
    ],

    'messages' => [
        'error_marked_success' => 'Направлення успішно позначено як помилкове',
        'error_prefix' => 'Помилка: '
    ],
];
